import pandas as pd
import pytest


@pytest.fixture()
def tr_list():
    return [{'Дата операции': '27.11.2023 13:08:09',
             'Номер карты': "*1049",
             'Статус': 'OK',
             'Сумма операции': -1875.0,
             'Валюта операции': "RUB",
             'Кэшбэк': 0,
             'Категория': 'Переводы',
             'Описание': 'Илья К.'
             },
            {'Дата операции': '24.11.2023 18:57:06',
             'Номер карты': "*7842",
             'Статус': 'OK',
             'Сумма операции': -1176.99,
             'Валюта операции': "RUB",
             'Кэшбэк': 11.0,
             'Категория': 'Супермаркеты',
             'Описание': 'Пятёрочка'
             },
            {'Дата операции': '04.11.2023 11:58:52',
             'Номер карты': "*9390",
             'Статус': 'FAILED',
             'Сумма операции': -112.0,
             'Валюта операции': "RUB",
             'Кэшбэк': 1.0,
             'Категория': 'Такси',
             'Описание': 'Яндекс Такси'
             },
            {'Дата операции': '17.11.2023 12:56:15',
             'Номер карты': "nan",
             'Статус': 'OK',
             'Сумма операции': -6200.0,
             'Валюта операции': "RUB",
             'Кэшбэк': 62.0,
             'Категория': 'Красота',
             'Описание': 'ООО ЛАЗЕРСТАР_QR'
             },
            {'Дата операции': '12.11.2023 11:50:27',
             'Номер карты': "nan",
             'Статус': 'OK',
             'Сумма операции': -280.0,
             'Валюта операции': "RUB",
             'Кэшбэк': "nan",
             'Категория': 'Мобильная связь',
             'Описание': 'Мегафон +7 928 000-00-00'
             },
            {'Дата операции': '05.11.2023 18:21:06',
             'Номер карты': "*9390",
             'Статус': 'OK',
             'Сумма операции': -465.0,
             'Валюта операции': "RUB",
             'Кэшбэк': 23.0,
             'Категория': 'Супермаркеты',
             'Описание': 'WILDBERRIES'
             },
            {'Дата операции': '06.09.2023 12:29:33',
             'Номер карты': "*7842",
             'Статус': 'OK',
             'Сумма операции': -900.0,
             'Валюта операции': "RUB",
             'Кэшбэк': 9.0,
             'Категория': 'Фастфуд',
             'Описание': 'Port S N 8'
             },
            {'Дата операции': '15.09.2023 16:50:31',
             'Номер карты': "*7842",
             'Статус': 'OK',
             'Сумма операции': -414.0,
             'Валюта операции': "RUB",
             'Кэшбэк': -414.0,
             'Категория': 'Аптеки',
             'Описание': 'Аптека'
             },
            ]


@pytest.fixture
def dataframe():
    return pd.DataFrame([{"date": "2023-09-05T11:30:32Z",
                          "amount": "26165.0",
                          "currency_name": "rubles",
                          "currency_code": "RUB",
                          },
                         ])


@pytest.fixture()
def settings():
    return {
        "user_currencies": ["USD"],
        "user_stocks": ["AAPL"]
    }


@pytest.fixture()
def rates():
    return {'success': True, 'timestamp': 1701244383, 'base': 'RUB', 'date': '2023-11-29',
            'rates': {'AED': 0.041294, 'AFN': 0.780329, 'ALL': 1.045649, 'AMD': 4.500327, 'ANG': 0.020162,
                      'AOA': 9.308104, 'ARS': 4.042876, 'AUD': 0.016963, 'AWG': 0.02024, 'AZN': 0.019272,
                      'BAM': 0.019981, 'BBD': 0.022587, 'BDT': 1.233325, 'BGN': 0.020019, 'BHD': 0.004238,
                      'BIF': 31.812289, 'BMD': 0.011244, 'BND': 0.01495, 'BOB': 0.077297, 'BRL': 0.054775,
                      'BSD': 0.011187, 'BTC': 2.97147e-07, 'BTN': 0.932336, 'BWP': 0.151376, 'BYN': 0.036851,
                      'BYR': 220.391871, 'BZD': 0.02255, 'CAD': 0.01525, 'CDF': 29.966545, 'CHF': 0.009871,
                      'CLF': 0.000354, 'CLP': 9.756504, 'CNY': 0.079577, 'COP': 44.473955, 'CRC': 5.926537,
                      'CUC': 0.011244, 'CUP': 0.297979, 'CVE': 1.126512, 'CZK': 0.248052, 'DJF': 1.991791,
                      'DKK': 0.07632, 'DOP': 0.635154, 'DZD': 1.508985, 'EGP': 0.347452, 'ERN': 0.168667,
                      'ETB': 0.622922, 'EUR': 0.010236, 'FJD': 0.025044, 'FKP': 0.008847, 'GBP': 0.008859,
                      'GEL': 0.030379, 'GGP': 0.008847, 'GHS': 0.134244, 'GIP': 0.008847, 'GMD': 0.756794,
                      'GNF': 96.125293, 'GTQ': 0.087616, 'GYD': 2.340477, 'HKD': 0.087692, 'HNL': 0.276875,
                      'HRK': 0.079179, 'HTG': 1.480855, 'HUF': 3.862121, 'IDR': 173.3011, 'ILS': 0.041386,
                      'IMP': 0.008847, 'INR': 0.936722, 'IQD': 14.64433, 'IRR': 475.21999, 'ISK': 1.54252,
                      'JEP': 0.008847, 'JMD': 1.737198, 'JOD': 0.007977, 'JPY': 1.656087, 'KES': 1.720405,
                      'KGS': 0.99985, 'KHR': 46.034708, 'KMF': 5.035841, 'KPW': 10.120146, 'KRW': 14.508588,
                      'KWD': 0.003468, 'KYD': 0.009323, 'KZT': 5.150035, 'LAK': 231.360736, 'LBP': 168.140593,
                      'LKR': 3.686284, 'LRD': 2.114525, 'LSL': 0.209069, 'LTL': 0.033202, 'LVL': 0.006802,
                      'LYD': 0.05381, 'MAD': 0.112638, 'MDL': 0.199516, 'MGA': 50.193204, 'MKD': 0.629484,
                      'MMK': 23.492626, 'MNT': 38.948789, 'MOP': 0.089841, 'MRO': 4.014279, 'MUR': 0.495898,
                      'MVR': 0.1726, 'MWK': 18.831902, 'MXN': 0.19268, 'MYR': 0.052315, 'MZN': 0.711213,
                      'NAD': 0.212074, 'NGN': 8.832089, 'NIO': 0.409466, 'NOK': 0.119591, 'NPR': 1.491738,
                      'NZD': 0.018253, 'OMR': 0.004329, 'PAB': 0.011187, 'PEN': 0.041682, 'PGK': 0.041713,
                      'PHP': 0.622669, 'PKR': 3.194438, 'PLN': 0.044265, 'PYG': 83.253495, 'QAR': 0.040941,
                      'RON': 0.050891, 'RSD': 1.197363, 'RUB': 1, 'RWF': 13.859577, 'SAR': 0.042172, 'SBD': 0.095299,
                      'SCR': 0.147206, 'SDG': 6.752613, 'SEK': 0.116414, 'SGD': 0.014973, 'SHP': 0.013682,
                      'SLE': 0.254353, 'SLL': 222.078544, 'SOS': 6.426423, 'SRD': 0.426284, 'STD': 232.7381,
                      'SYP': 146.200569, 'SZL': 0.209079, 'THB': 0.390527, 'TJS': 0.122107, 'TMT': 0.039468,
                      'TND': 0.034785, 'TOP': 0.026503, 'TRY': 0.325512, 'TTD': 0.075898, 'TWD': 0.350966,
                      'TZS': 28.279872, 'UAH': 0.406898, 'UGX': 42.561549, 'USD': 0.011244, 'UYU': 0.439305,
                      'UZS': 137.768239, 'VEF': 39833.622374, 'VES': 0.398353, 'VND': 272.650607, 'VUV': 1.346302,
                      'WST': 0.030875, 'XAF': 6.701523, 'XAG': 0.000451, 'XAU': 5.505821e-06, 'XCD': 0.030389,
                      'XDR': 0.008405, 'XOF': 6.701523, 'XPF': 1.224243, 'YER': 2.815058, 'ZAR': 0.208826,
                      'ZMK': 101.213864, 'ZMW': 0.264401, 'ZWL': 3.620719}}
